dotfiles.html

<div id="outline-container-orgcda047e" class="outline-2">
<h2 id="orgcda047e"><span class="section-number-2">3.</span> Zellij</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">keybinds clear-defaults</span>=true {
    <span class="org-type">locked</span> {
        bind <span class="org-string">"Ctrl x"</span> { SwitchToMode <span class="org-string">"normal"</span>; }
    }
    <span class="org-type">normal</span> {
        bind <span class="org-string">"Ctrl x"</span> { SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"|"</span> { NewPane <span class="org-string">"right"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"_"</span> { NewPane <span class="org-string">"down"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"t"</span> { NewTab; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"1"</span> { GoToTab 1; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"2"</span> { GoToTab 2; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"3"</span> { GoToTab 3; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"4"</span> { GoToTab 4; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"5"</span> { GoToTab 5; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"6"</span> { GoToTab 6; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"7"</span> { GoToTab 7; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"8"</span> { GoToTab 8; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"9"</span> { GoToTab 9; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"p"</span> { GoToPreviousTab; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"n"</span> { GoToNextTab; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"left"</span> { MoveFocus <span class="org-string">"left"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"down"</span> { MoveFocus <span class="org-string">"down"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"up"</span> { MoveFocus <span class="org-string">"up"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"right"</span> { MoveFocus <span class="org-string">"right"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"h"</span> { MoveFocus <span class="org-string">"left"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"j"</span> { MoveFocus <span class="org-string">"down"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"k"</span> { MoveFocus <span class="org-string">"up"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"l"</span> { MoveFocus <span class="org-string">"right"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"o"</span> { SwitchFocus; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"x"</span> { CloseFocus; SwitchToMode <span class="org-string">"locked"</span>; }
    }
    <span class="org-type">pane</span> {
        bind <span class="org-string">"left"</span> { MoveFocus <span class="org-string">"left"</span>; }
        bind <span class="org-string">"down"</span> { MoveFocus <span class="org-string">"down"</span>; }
        bind <span class="org-string">"up"</span> { MoveFocus <span class="org-string">"up"</span>; }
        bind <span class="org-string">"right"</span> { MoveFocus <span class="org-string">"right"</span>; }
        bind <span class="org-string">"h"</span> { MoveFocus <span class="org-string">"left"</span>; }
        bind <span class="org-string">"j"</span> { MoveFocus <span class="org-string">"down"</span>; }
        bind <span class="org-string">"k"</span> { MoveFocus <span class="org-string">"up"</span>; }
        bind <span class="org-string">"l"</span> { MoveFocus <span class="org-string">"right"</span>; }
        bind <span class="org-string">"c"</span> { SwitchToMode <span class="org-string">"renamepane"</span>; PaneNameInput 0; }
        bind <span class="org-string">"d"</span> { NewPane <span class="org-string">"down"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"e"</span> { TogglePaneEmbedOrFloating; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"f"</span> { ToggleFocusFullscreen; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"i"</span> { TogglePanePinned; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"n"</span> { NewPane; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"p"</span> { SwitchToMode <span class="org-string">"normal"</span>; }
        bind <span class="org-string">"r"</span> { NewPane <span class="org-string">"right"</span>; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"w"</span> { ToggleFloatingPanes; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"x"</span> { CloseFocus; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"z"</span> { TogglePaneFrames; SwitchToMode <span class="org-string">"locked"</span>; }
        bind <span class="org-string">"tab"</span> { SwitchFocus; }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e6ee16" class="outline-2">
<h2 id="org9e6ee16"><span class="section-number-2">4.</span> Powershell</h2>
<div class="outline-text-2" id="text-4">
<p>
Install <code>oh-my-posh</code> first.
</p>

<div class="org-src-container">
<pre class="src src-powershell">oh-my-posh init pwsh --config "$env:POSH_THEMES_PATH\amro.omp.json" | Invoke-Expression

Set-Alias -Name "ll" ls
Set-Alias -Name "l" ls
Set-Alias -Name "vi" nvim

Set-PSReadLineOption -EditMode Emacs

$env:XDG_CONFIG_HOME = "$HOME\.config"
$env:XDG_DATA_HOME = "$HOME\.local"
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
